{
  "id": 4,
  "titulo": "Módulo 4: Reconhecimento Inato e Sinalização",
  "subtopicos": [
    {
      "id": "4.1",
      "titulo": "Receptores de Reconhecimento de Padrão",
      "conteudo": "<p>Os receptores de reconhecimento de padrão (PRRs) são moléculas germinativamente codificadas que reconhecem estruturas comuns a classes de microrganismos, conhecidas como padrões moleculares associados a patógenos (PAMPs). Exemplos de PRRs incluem os receptores Toll-like (TLRs) localizados na membrana plasmática e em endossomos, os receptores tipo NOD (NLRs) no citoplasma e receptores do tipo lectina (CLRs). A ativação dos PRRs desencadeia cascatas de sinalização que induzem a expressão de citocinas inflamatórias, interferons e moléculas coestimulatórias.</p>",
      "imagens": [
        {
          "src": "fig4-1.png",
          "legenda": "FIGURA 4.1 PRRs e sinalização inata.",
          "descricao_detalhada": "Ilustração abstrata de receptores Toll-like e NOD reconhecendo PAMPs bacterianos e virais e ativando vias de sinalização."
        }
      ],
      "flashcards": [
        {
          "frente": "O que são PAMPs?",
          "verso": "São padrões moleculares associados a patógenos reconhecidos pelos PRRs do sistema imune inato."
        },
        {
          "frente": "Qual é a principal função dos TLRs?",
          "verso": "Reconhecer PAMPs e ativar vias de sinalização que induzem respostas inflamatórias e antivirais."
        }
      ]
    },
    {
      "id": "4.2",
      "titulo": "Células Efetoras da Imunidade Inata",
      "conteudo": "<p>As células efetoras da imunidade inata incluem neutrófilos, macrófagos, mastócitos e células Natural Killer. Neutrófilos e macrófagos realizam fagocitose e produção de espécies reativas de oxigênio. Mastócitos e basófilos, recobertos por IgE, liberam mediadores que contribuem para inflamação e defesa contra parasitas. As células NK reconhecem células infectadas e tumorais que apresentam baixa expressão de MHC classe I e induzem apoptose por mecanismos de perfurina e granzima.</p>",
      "imagens": [
        {
          "src": "fig4-1.png",
          "legenda": "FIGURA 4.2 Células da imunidade inata.",
          "descricao_detalhada": "Gráfico conceptual das principais células inatas: neutrófilos, macrófagos, mastócitos e células NK."
        }
      ],
      "flashcards": [
        {
          "frente": "Como as células NK reconhecem células alvo?",
          "verso": "Detectando a diminuição de MHC classe I e a presença de ligantes de receptores ativadores."
        },
        {
          "frente": "Quais células liberam histamina em reações alérgicas?",
          "verso": "Mastócitos e basófilos."
        }
      ]
    }
  ]
}